<a href="https://colab.research.google.com/github/lethikieuly/PANDAS-FUNCTION/blob/main/pandas_DataFrame_sample.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**STRUCTURE**:

DataFrame.sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None, ignore_index=False)
-> Return a random sample of items from an axis of object.*italicized text*

In [13]:
import pandas as pd

In [15]:
df=pd.DataFrame([('Linda', 'Female', 40.8),
                   ('Asex', 'Female', 41.0),
                   ('Blax', 'male', 50),
                   ('Square', 'male', 60),
                   ('Page', 'male', 70),
                   ('Tompkins', 'male', 55),
                   ('Als Place', 'Female', 56.52),],
            columns=('name', 'sex', 'Age')
              )
df

        name     sex    Age
0      Linda  Female  40.80
1       Asex  Female  41.00
2       Blax    male  50.00
3     Square    male  60.00
4       Page    male  70.00
5   Tompkins    male  55.00
6  Als Place  Female  56.52

1/ n:int, optional

Number of items from axis to return. Cannot be used with frac. Default = 1 if frac = None.

**ex**: n=2 result: return two **`"random"`** rows back.

In [16]:
df.sample(n=2)

        name     sex    Age
0      Linda  Female  40.80
6  Als Place  Female  56.52

2/ fracfloat, optional

Fraction of axis items to return. Cannot be used with n.

Ex: frac=.3 or 30% result: return 30% 7 row in df = 2  row ( 2.1 rounded up )

In [17]:
df.sample(frac=.3)

       name     sex   Age
0     Linda  Female  40.8
5  Tompkins    male  55.0

2/ replace: bool, default False

Allow or disallow sampling of the same row more than once.

Ex: replace= true result: row can appear repeatedly

In [19]:
df.sample(n=4, replace= True)

       name     sex   Age
5  Tompkins    male  55.0
0     Linda  Female  40.8
0     Linda  Female  40.8
5  Tompkins    male  55.0

In [23]:
df.sample(frac=.7, replace=False)
#it not repeat

        name     sex    Age
1       Asex  Female  41.00
0      Linda  Female  40.80
4       Page    male  70.00
5   Tompkins    male  55.00
6  Als Place  Female  56.52

3/weightsstr or ndarray-like, optional

Default ‘None’ results in equal probability weighting.

Ex: However, what if you wanted to select female more often than male? You could give female a higher chance (higher weights) to be picked.

In [28]:
weights={"Female":5, "male":1}
df ["weights"]=df["sex"].apply(lambda x: weights[x])
df

        name     sex    Age  weights
0      Linda  Female  40.80        5
1       Asex  Female  41.00        5
2       Blax    male  50.00        1
3     Square    male  60.00        1
4       Page    male  70.00        1
5   Tompkins    male  55.00        1
6  Als Place  Female  56.52        5

4/ random_state: int, array-like, BitGenerator, np.random.RandomState, optional

Ex: Here I'll pull a random sample of 3 rows from my DataFrame and pass my weights column. I set random state to make sure I get the same random numbers each time. Notice how 2 restaurants pop up out of the 3 rows. That is because they had higher weights and therefore a bigger chance to be picke

In [29]:
df.sample(n=3,weights='weights', random_state=42)

        name     sex    Age  weights
1       Asex  Female  41.00        5
6  Als Place  Female  56.52        5
5   Tompkins    male  55.00        1

5/ axis: {0 or ‘index’, 1 or ‘columns’, None}, default None

Axis to sample. Accepts axis number or name. Default is stat axis for given data type (0 for Series and DataFrames).

Ex axis = 1, convert rows to colums

In [35]:
df.sample (n=4, axis=1)

        name  weights     sex    Age
0      Linda        5  Female  40.80
1       Asex        5  Female  41.00
2       Blax        1    male  50.00
3     Square        1    male  60.00
4       Page        1    male  70.00
5   Tompkins        1    male  55.00
6  Als Place        5  Female  56.52

In [36]:
df.sample (n=2, axis=1)

   weights     sex
0        5  Female
1        5  Female
2        1    male
3        1    male
4        1    male
5        1    male
6        5  Female

6/ ignore_index: bool, default False

If True, the resulting index will be labeled 0, 1, …, n - 1.

New in version 1.3.0.